Tekla Open API Reference for Tekla Structures 2025
PickerInputObjectAndAPoint Properties
The PickerInputObjectAndAPoint type exposes the following members.
Properties
Name | Description
PickedObject
 Gets or sets the picked object in the view.
 (Inherited from PickerInputObject.)
PickedPoint
 Gets or sets the picked point in the view coordinates.
PickedView
 The view within which the pick occurred.
 (Inherited from PickerInputWithinAView.)
Top
See Also
Reference
PickerInputObjectAndAPoint Class
Tekla.Structures.Drawing Namespace